system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
	//right side
	(0 0 -2)//0
	(450 0 -2)//1
	(450 100 -2)//2
	(0 100 -2)//3

	(0 0 2)//4
	(450 0 2)//5
	(450 100 2)//6
	(0 100 2)//7
	// left side
	(-50 50 -2)//8
	(0 50 -2)//9
	(0 100 -2)//10
	(-50 100 -2)//11

	(-50 50 2)//12
	(0 50 2)//13
	(0 100 2)//14
	(-50 100 2)//15

	//circle pipe
	(450 80 -1)//16
	(450 80 1)//17
	(450 81 0)//18
	(450 79 0)//19
	(450 80 0)//20
	//B
	(500 80 -1)//21
	(500 80 1)//22
	(500 81 0)//23
	(500 79 0)//24
	(500 80 0)//25

	//right sight
	(450 50 -2)//26
	(450 50 2)//27
	(450 50 -2)//28
	(450 50 2)//29
);	

blocks
(
	hex (9 28 6 14 13 29 6 7) (10 10 10) simpleGrading (1.8 1.8 1.8	)//top
	hex (0 1 26 9 4 5 27 13) (20 50 20) simpleGrading (1.8 1.8 1.8)//bot
	//hex (0 1 2 3 4 5 6 7) (10 10 10) simpleGrading (1.8 1.8 1.8	)//top
	hex (8 9 10 11 12 13 14 15) (10 10 10) simpleGrading (1.8 1.8 1.8)//left side
	hex (16 18 17 19 21 23 22 24) (10 10 10) simpleGrading (1.8 1.8 1.8)//pipe
	//hex () (10 10 10) simpleGrading (1.8 1.8 1.8)
	//hex () (10 10 10) simpleGrading (1.8 1.8 1.8)
	//hex () (10 10 10) simpleGrading (1.8 1.8 1.8)
);
edges
(
	//arc 16 18 (450 56.922 -0.3535)
	//arc 16 18 (450 56.922 -0.3535)
);

boundary
(
	//inlet
	//{
		//type patch;
		//faces
		//(
		//	(8 11 12 15)
		
		//)//;
	//}//
	//outlet
	//{
	//	type patch;
	//	faces
	//	(
	//		(21 22 23 24)
	//	);
	
	//}
	//upperWall
	//{
	//	type wall;
	//	faces
	//	(
	//		()
	//	);
	//}
);

mergePatchPairs
(
);

// ************************************************************************* //
